# CheckRangeOfShadeDepth Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..CheckRangeOfShadeDepth Method
EnergyDataSettings Class See Also
---
Checks that the shade depth is greater than or equal to zero.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool CheckRangeOfShadeDepth(
	double shadeDepth
)
```

Visual Basic
---
```text
Public Shared Function CheckRangeOfShadeDepth ( _
	shadeDepth As Double _
) As Boolean
```

Visual C++
---
```text
public:
static bool CheckRangeOfShadeDepth(
	double shadeDepth
)
```

# ### Parameters
shadeDepth
    Type: System..::..Double The shade depth to be checked.
# ### Return Value
True if the shade depth is greater than or equal to zero, false otherwise.
# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace